# Цель: более глубоко понять особенности работы с функциями генераторами и оператором yield в Python

# Данная функцию-генератор all_variants принимает строку text и возвращает объект-генератор,
# при каждой итерации которого будет возвращаться подпоследовательности переданной строки
def all_variants(text):

    # Вычисляем длину строки text и сохраняем ее в переменную length_str
    length_str = len(text)

    # Проходим по каждому индексу строки от 0 до length-1, используя переменную i
    for i in range(length_str):

        # Проходим по каждому индексу строки от i + 1 до length_str, с помощью переменной j
        # генерируя все возможные конечные индексы для подстрок, начиная с индекса i
        for j in range(i + 1, length_str + 1):

            # С помощью yield возвращаем подстроку от i до j
            yield text[i:j]

a = all_variants("abc")
for i in a:
    print(i)
